adjusted readme
